<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7a586124379f5f8292e36907115542ddeb83e03f808c4f0ccc359af987b8588f","plan_job_ref":"Job Create Tofu plan #7 at https://github.com/cleanlab/control-plane/actions/runs/13253718826","plan_out_hash":"a8694d0920c2c4d536dc40b9a957287389bc5de03971a12aa16e642f74a9f860","plan_hash":"76c453bb5fd1a7b49c0476791aaafc1a36fd35ce13a8577af3443692a28e3997","plan_text_format":"diff","version":"1.46.1"} -->
OpenTofu plan in __infra/environments/staging__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.vpc.aws_internet_gateway.this will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "staging-vpc-igw"
        }
+       tags_all = {
+           "Name" = "staging-vpc-igw"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "staging-vpc-subnet-1"
        }
+       tags_all                                       = {
+           "Name" = "staging-vpc-subnet-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "staging-vpc-subnet-2"
        }
+       tags_all                                       = {
+           "Name" = "staging-vpc-subnet-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "staging-vpc"
        }
+       tags_all                             = {
+           "Name" = "staging-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Tofu plan #7](https://github.com/cleanlab/control-plane/actions/runs/13253718826)